# 판다스 연습문제

In [1]:
import numpy as np 
import pandas as pd

- 연습 문제 4.1.1

In [2]:
# 1)
s1 = pd.Series([1,3,6], index=['a','b','c'])
s2 = pd.Series([2,4,5], index=['a','b','d'])

In [3]:
# 2)
s1 + s2

a    3.0
b    7.0
c    NaN
d    NaN
dtype: float64

In [4]:
s1 * s2

a     2.0
b    12.0
c     NaN
d     NaN
dtype: float64

In [5]:
s1 - s2

a   -1.0
b   -1.0
c    NaN
d    NaN
dtype: float64

In [6]:
s1 / s2

a    0.50
b    0.75
c     NaN
d     NaN
dtype: float64

- 연습 문제 4.1.2

In [7]:
pd.DataFrame({
    'int1':[1,2,3,4,5],
    'int2':[10,20,30,40,50],
    'int3':[100,200,300,400,500],
    'string':['a','b','c','d','e'],
    'float':[3.14,1.414,1.732,2.718,2.235]
})

   int1  int2  int3 string  float
0     1    10   100      a  3.140
1     2    20   200      b  1.414
2     3    30   300      c  1.732
3     4    40   400      d  2.718
4     5    50   500      e  2.235

- 연습 문제 4.1.3

In [8]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [9]:
# 1)
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [10]:
# 2)
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [11]:
# 3)
df['평균'] = np.round(df.mean(axis=1), 2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [12]:
# 4)
del df['평균']
df['영어'][3] = 80
df['평균'] = np.round(df.mean(axis=1), 2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [13]:
# 5)
df[:'춘향']

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [14]:
df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

- 연습 문제 4.3.1

In [15]:
# 1)
np.random.seed(2021)
df = pd.DataFrame(np.random.randint(1, 100, 25).reshape(5,5),
                  index=['a','b','c','d','e'],
                  columns=['v','w','x','y','z'])
df

    v   w   x   y   z
a  86  58   1  95  87
b  45  63  92  30  22
c  94  25  13  71  71
d  34   8   2  98  27
e  67  49  64  50  17

In [16]:
# 2) 63을 선택
df['w']['b'], df.w['b'], df.w[1], df.w.b

(63, 63, 63, 63)

In [17]:
df.loc['b','w'], df.loc['b']['w'], df.loc['b'][1]

(63, 63, 63)

In [18]:
df.iloc[1,1], df.iloc[1][1], df.iloc[1]['w']

(63, 63, 63)

- 연습 문제 4.4.1

In [19]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

- 연습 문제 4.4.2

In [20]:
titanic.sex.value_counts().sort_values()

female    314
male      577
Name: sex, dtype: int64

In [21]:
titanic.age.value_counts().sort_values()

12.00     1
24.50     1
66.00     1
20.50     1
0.67      1
         ..
19.00    25
28.00    25
18.00    26
22.00    27
24.00    30
Name: age, Length: 88, dtype: int64

In [22]:
titanic['class'].value_counts().sort_values()

Second    184
First     216
Third     491
Name: class, dtype: int64

In [23]:
titanic.alive.value_counts().sort_values()

yes    342
no     549
Name: alive, dtype: int64

- 연습 문제 4.4.3

In [24]:
# 1)
titanic.age.mean()

29.69911764705882

In [25]:
titanic[titanic.sex == 'female'].age.mean()

27.915708812260537

In [26]:
titanic.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [27]:
dft = titanic[titanic.pclass == 1]
dft[dft.sex == 'female'].age.mean()

34.61176470588235

- 연습 문제 4.4.4

In [31]:
titanic = sns.load_dataset('titanic')
titanic = titanic[['survived','pclass','sex','age']]

In [32]:
import warnings
warnings.filterwarnings('ignore')

In [33]:
titanic['category1'] = titanic.apply(
    lambda r: r.sex if r.age >= 20 else 'child', axis=1
)
titanic.tail()

     survived  pclass     sex   age category1
886         0       2    male  27.0      male
887         1       1  female  19.0     child
888         0       3  female   NaN     child
889         1       1    male  26.0      male
890         0       3    male  32.0      male

- 연습 문제 4.4.5

In [34]:
# titanic['age'] = titanic.age.fillna(np.round(titanic.age.mean()))
titanic.age.fillna(np.round(titanic.age.mean()), inplace=True)
titanic.tail()

     survived  pclass     sex   age category1
886         0       2    male  27.0      male
887         1       1  female  19.0     child
888         0       3  female  30.0     child
889         1       1    male  26.0      male
890         0       3    male  32.0      male

- 연습 문제 4.4.6

In [35]:
titanic['category2'] = titanic.sex + titanic.age.astype(int).astype(str)
titanic.tail()

     survived  pclass     sex   age category1 category2
886         0       2    male  27.0      male    male27
887         1       1  female  19.0     child  female19
888         0       3  female  30.0     child  female30
889         1       1    male  26.0      male    male26
890         0       3    male  32.0      male    male32

- 연습 문제 4.4.7

In [36]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(titanic.age.values, bins, labels=labels)
cats

['청년', '중년', '청년', '중년', '중년', ..., '청년', '미성년자', '청년', '청년', '중년']
Length: 891
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [37]:
cats.value_counts()

미성년자    165
청년      407
중년      241
장년       59
노년        5
dtype: int64

In [38]:
df = pd.DataFrame(cats.value_counts(), columns=['인원수'])
df

      인원수
미성년자  165
청년    407
중년    241
장년     59
노년      5

In [39]:
df['비율(%)'] = np.round(df['인원수'] / df['인원수'].sum() * 100, 2)
df

      인원수  비율(%)
미성년자  165  18.81
청년    407  46.41
중년    241  27.48
장년     59   6.73
노년      5   0.57

In [40]:
df['비율(%)'].sum()

100.0

- 연습 문제 4.4.8

In [42]:
titanic['group'] = pd.cut(titanic.age.values, bins, labels=labels)
titanic.tail()

     survived  pclass     sex   age category1 category2 group
886         0       2    male  27.0      male    male27    청년
887         1       1  female  19.0     child  female19  미성년자
888         0       3  female  30.0     child  female30    청년
889         1       1    male  26.0      male    male26    청년
890         0       3    male  32.0      male    male32    중년

In [43]:
titanic['성별'] = titanic.apply(lambda r: '남성' if r.sex == 'male' else '여성', axis=1)
titanic.tail()

     survived  pclass     sex   age category1 category2 group  성별
886         0       2    male  27.0      male    male27    청년  남성
887         1       1  female  19.0     child  female19  미성년자  여성
888         0       3  female  30.0     child  female30    청년  여성
889         1       1    male  26.0      male    male26    청년  남성
890         0       3    male  32.0      male    male32    중년  남성

In [46]:
titanic['category3'] = titanic.apply(
    lambda r: r.group + r.성별 if r.age >= 20 else '미성년자', 
    axis=1
)
titanic.tail()

     survived  pclass     sex   age category1 category2 group  성별 category3
886         0       2    male  27.0      male    male27    청년  남성      청년남성
887         1       1  female  19.0     child  female19  미성년자  여성      미성년자
888         0       3  female  30.0     child  female30    청년  여성      청년여성
889         1       1    male  26.0      male    male26    청년  남성      청년남성
890         0       3    male  32.0      male    male32    중년  남성      중년남성

- 연습 문제 4.5.1

In [47]:
np.random.seed(2021)
df_score1 = pd.DataFrame(np.random.randint(40, 100, 15).reshape(5,3), 
                         columns=['국어','영어','수학'])
df_score1.index = ['김판다','이판다','박판다','최판다','정판다']
df_score1.index.name = '이름'
df_score1

     국어  영어  수학
이름
김판다  92  61  97
이판다  40  85  70
박판다  62  84  67
최판다  69  61  69
정판다  64  52  94

In [48]:
df_score2 = df_score1.reset_index()
df_score2

    이름  국어  영어  수학
0  김판다  92  61  97
1  이판다  40  85  70
2  박판다  62  84  67
3  최판다  69  61  69
4  정판다  64  52  94

In [49]:
df_score2.set_index('이름')

     국어  영어  수학
이름
김판다  92  61  97
이판다  40  85  70
박판다  62  84  67
최판다  69  61  69
정판다  64  52  94